# 判断成绩
print("1、判断成绩所在的区间？")
cj = int(input("请输入你的成绩："))
if cj>=90 and cj<=100:
    print("你的成绩考核为A！请继续保持！！！")
elif cj>=80 and cj<90:
    print("你的成绩考核为B！")
elif cj>=70 and cj<80:
    print("你的成绩考核为C！")
elif cj>=60 and cj<70:
    print("你的成绩考核为D！")
elif cj>=0 and cj<60:
    print("你的成绩考核为E！ 要努力了！！！")
else:
    print("请输入正确的成绩！")
print("======================================请执行下一个！============================================")

# 计算闰年
print("2、计算所查询年份是否为闰年？")
rn = int(input("请输入你需要查询的年份："))
if rn/400!=0 and rn/4==0:
    print("你查询的年份是闰年！")
else:
    print("你查询的年份不是闰年！")
print("======================================请执行下一个！============================================")

# 比较输入数字的大小
print("3、求三个数字最大值？")
a = int(input("请输入第一个数字："))
b = int(input("请输入第二个数字："))
c = int(input("请输入第三个数字："))
d = max(a,b,c)
# print(d) 
# 没有解释说明数字含义 
print("输出最大数字是：%s"%d)
print("======================================请执行下一个！============================================")

# # 求输入数字的和
print("4、求输入数字之和？")
num1 = input("输入第一个数字：")
num2 = input("输入第二个数字：")
sum = float(num1)+float(num2)
print("数字{0}和{1}相加结果为：{2}".format(num1,num2,sum))
print("======================================请执行下一个！============================================")

# 求输入数字的乘积
print("5、求两个数字的乘积？")
num1 = input("输入第一个数字：")
num2 = input("输入第二个数字：")
sum = float(num1)*float(num2)
print("数字{0}和{1}相乘结果为：{2}".format(num1,num2,sum))
print("======================================请执行下一个！============================================")

print("6、比较两个数字大小？")
v = int(input("输入数字a:"))
x = int(input("输入数字b:"))
if v > x:
    print("输出最大的数字是：%s"%v)
else:
    print("输出最大的数字是：%s"%x)
print("======================================请执行下一个！============================================")

print("7、多条件选择判断")
cp = int(input("请输入是否有车票(0or1):"))

if cp ==1:
    print("有车票，可以进站")
    xdlenght = int(input("请输入刀子的长度："))
    if xdlenght<5:
        print("通过安检")
        print("可以上车！")
    else:
        print("没有通过安检！")
        print("刀子的长度超过了规定长度，请等待处理")
else:
    print("没有车票，不能进站！")
print("======================================请执行下一个！============================================")


print("8、多条件选择判断是否可以整除")
num = int(input("输入一个数字："))
if num%2==0:
    if num%3==0:
        print("你输入的数字可以整除2和3")
    else:
        print("你输入的数字可以整除2不能整除3")
else:
    if num%3==0:
        print("你输入的数字可以整除3，但不能整除2")
    else:
        print("你输入的数字不能整除2和3")